app/Models/UserModel.php

    public function getUser($name)
    {
        return $this->where('name', $name)->first();
---
SELECT *
FROM `users`
WHERE `name` = 'kharon'
 LIMIT 1